src/cf/InformationRegisters/ПочтовыеСообщенияПоДокументу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ПочтовыеСообщенияПоДокументу</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Задание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПочтовогоСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидПочтовогоСообщения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АдресПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/ЭкспортируемыеПодпрограммы/Ext/Module.bsl
&НаСервере
Процедура ПослатьСообщение(Адрес, ТекстСообщения, ТекстЗаголовок = "Служебное сообщение tlist", Пользователь=Неопределено) Экспорт

    Если СокрЛП(Адрес)="" Тогда
        мОшибка = "У пользователя: ("+Пользователь.Код+") "+Пользователь+" не настроен емейл!"; 
        Сообщить(мОшибка); 
		//==#17252#IVS Хотеев Begin 15.08.17 --------------------------
		//ПослатьСообщение("dimma@videosrv.com.ru",ТекстСообщения+Символы.ПС+мОшибка,"Не найден отправитель для сообщения!");
		ПочтовыйАдресАдминистраторРазработчикТЛист=ПолучитьЗначениеКонстанты("ПочтовыйАдресАдминистраторРазработчикТЛист",Текущаядата(),ложь);
		Если сокрлп(ПочтовыйАдресАдминистраторРазработчикТЛист)<>"" Тогда
	        ПослатьСообщение(сокрлп(ПочтовыйАдресАдминистраторРазработчикТЛист),ТекстСообщения+Символы.ПС+мОшибка,"Не найден отправитель для сообщения!");
		КонецЕсли; 
		//==#17252#IVS Хотеев End   15.08.17 --------------------------
		Возврат;
	КонецЕсли;   
	
	ОбратныйАдрес = Константы.ПочтаЛогин.Получить(); 
	
	Сообщение = Новый ИнтернетПочтовоеСообщение;
	Сообщение.Тема = ТекстЗаголовок;
	Сообщение.Получатели.Добавить(Адрес);
	
	Сообщение.ИмяОтправителя = "tlist"; // Это виртуальное имя для идентификации письма
	Сообщение.Отправитель = ОбратныйАдрес;
	
	Текст = Сообщение.Тексты.Добавить(ТекстСообщения);
	Текст.ТипТекста = ТипТекстаПочтовогоСообщения.HTML;
	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	
	Профиль.АдресСервераSMTP = Константы.ПочтовыйСервер.Получить();
	Профиль.АутентификацияSMTP = СпособSMTPАутентификации.Login;
	Профиль.ПользовательSMTP = Константы.ПочтаЛогин.Получить(); 
	Профиль.ПарольSMTP = Константы.ПочтаПароль.Получить();
    Профиль.ВремяОжидания = 20;
	
	Почта = Новый ИнтернетПочта;
	
	Почта.Подключиться(Профиль);
	Почта.Послать(Сообщение);
	Почта.Отключиться();

КонецПроцедуры

&НаСервере
Функция СообщениеЕщёНеОтправлено(Задание, ВидПочтовогоСообщения, АдресПолучателя) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПочтовыеСообщенияПоДокументу.Отправлено
	|ИЗ
	|	РегистрСведений.ПочтовыеСообщенияПоДокументу КАК ПочтовыеСообщенияПоДокументу
	|ГДЕ
	|	ПочтовыеСообщенияПоДокументу.Задание = &Задание
	|	И ПочтовыеСообщенияПоДокументу.ВидПочтовогоСообщения = &ВидПочтовогоСообщения
	|	И ПочтовыеСообщенияПоДокументу.АдресПолучателя = &АдресПолучателя";
	
	Запрос.УстановитьПараметр("Задание", Задание);
	Запрос.УстановитьПараметр("ВидПочтовогоСообщения", ВидПочтовогоСообщения);
	Запрос.УстановитьПараметр("АдресПолучателя", АдресПолучателя);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат НЕ Результат.Отправлено;
	Иначе
		Возврат	Истина;	
	КонецЕсли; 		

КонецФункции
 
&НаСервере
Процедура ЗаписатьВЖурналПочты(Задание, ВидПочтовогоСообщения, АдресПолучателя) Экспорт
    НоваяЗапись = РегистрыСведений.ПочтовыеСообщенияПоДокументу.СоздатьМенеджерЗаписи();
	НоваяЗапись.Задание = Задание;
	НоваяЗапись.ВидПочтовогоСообщения = ВидПочтовогоСообщения;
	НоваяЗапись.АдресПолучателя = АдресПолучателя;
	НоваяЗапись.Отправлено = Истина;
	НоваяЗапись.Записать();
КонецПроцедуры
